# Module: SQLite3 Assignments
## Lesson: SQLite3
### Assignment 1: Creating and Connecting to a Database

1. Create a new SQLite3 database named `test.db`.

In [1]:
import sqlite3

In [23]:
connection = sqlite3.connect('test.db')

2. Create a table named `employees` with columns `id` (integer), `name` (text), `age` (integer), and `department` (text) in the `test.db` database.

In [24]:
cursor = connection.cursor()

In [14]:
cursor.execute(''' DROP TABLE IF EXISTS Employees ''')
connection.commit()

In [15]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS Employees 
               (
               id Integer PRIMARY KEY,
               name VARCHAR,
               age Integer, 
               department VARCHAR
               )
''')

connection.commit()

### Assignment 2: Inserting Data

1. Insert a new employee into the `employees` table.

In [16]:
cursor.executemany('''
INSERT INTO Employees (name, age, department) 
                   values(?,?,?)
               ''', 
               [
                   ('Kr',60,'Sales' ),
                   ('Mr',50,'HR')
                   ]
                   )

connection.commit()

In [17]:
cursor.execute("Select * from Employees")
cursor.fetchall()

[(1, 'Kr', 60, 'Sales'), (2, 'Mr', 50, 'HR')]

In [21]:
def funct_insert(name, age, dept):
    # connection.
    cursor.executemany('''
                       INSERT INTO Employees (name, age, department) 
                   values(?,?,?)
               ''', 
               [(name, age,dept)]
                   )
    connection.commit()
    # connection.close()

2. Insert at least 5 different employees into the `employees` table.

In [25]:
funct_insert('Bob', 25, 'Engineering')
funct_insert('Charlie', 28, 'Sales')
funct_insert('David', 35, 'Marketing')
funct_insert('Eve', 22, 'HR')

In [26]:
cursor.execute("Select * from Employees")
cursor.fetchall()

[(1, 'Kr', 60, 'Sales'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Marketing'),
 (7, 'Eve', 22, 'HR')]

### Assignment 3: Querying Data

1. Write a Python function to fetch and display all records from the `employees` table.

In [31]:
def func_tbl(nm):
    cursor.execute(f'''
    Select * from {nm}
    ''')
    return cursor.fetchall()

In [32]:
func_tbl('Employees')

[(1, 'Kr', 60, 'Sales'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Marketing'),
 (7, 'Eve', 22, 'HR')]

2. Write a Python function to fetch and display all employees from a specific department.

In [33]:
def func_tbl_dept(nm, dept):
    cursor.execute(f'''
    Select * from {nm} where department = '{dept}';
    ''')
    return cursor.fetchall()

In [34]:
func_tbl_dept('Employees','Engineering')

[(3, 'Bob', 25, 'Engineering'), (4, 'Bob', 25, 'Engineering')]

In [35]:
func_tbl_dept('Employees','HR')

[(2, 'Mr', 50, 'HR'), (7, 'Eve', 22, 'HR')]

### Assignment 4: Updating Data

1. Write a Python function to update the department of an employee based on their `id`.

In [37]:
def upt_tbl(tbl, dept, id):
    cursor.execute(f'''
     UPDATE {tbl}
     SET department = '{dept}'
     WHERE id = {id}

''')
    connection.commit()

In [38]:
func_tbl('Employees')

[(1, 'Kr', 60, 'Sales'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Marketing'),
 (7, 'Eve', 22, 'HR')]

In [39]:
upt_tbl('Employees','Engineering',6)

In [40]:
func_tbl('Employees')

[(1, 'Kr', 60, 'Sales'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Engineering'),
 (7, 'Eve', 22, 'HR')]

2. Update the department of at least 2 employees and display the updated records.

In [41]:
func_tbl('Employees')

[(1, 'Kr', 60, 'Sales'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Engineering'),
 (7, 'Eve', 22, 'HR')]

In [42]:
upt_tbl('Employees','Sales',7)
upt_tbl('Employees','HR',1)

In [43]:
func_tbl('Employees')

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Engineering'),
 (7, 'Eve', 22, 'Sales')]

### Assignment 5: Deleting Data

1. Write a Python function to delete an employee from the `employees` table based on their `id`.
2. Delete at least 1 employee and display the remaining records.

In [56]:
def del_record(tbl, id):
    cursor.execute(f'''
      DELETE FROM {tbl}
      WHERE id = {id}

        ''')
    connection.commit()
    return cursor.execute(f"select * from {tbl}").fetchall()

In [57]:
func_tbl('Employees')

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'David', 35, 'Engineering')]

In [58]:
del_record('Employees',6)

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales')]

### Assignment 6: Advanced Queries

1. Write a Python function to fetch and display employees older than a certain age.

In [59]:
def func_filter(tbl,age):
    cursor.execute(f'''
        Select * from {tbl}
          where age > {age}
''')
    return cursor.fetchall()

In [62]:
func_tbl('Employees')

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales')]

In [63]:
func_filter('Employees',27)

[(1, 'Kr', 60, 'HR'), (2, 'Mr', 50, 'HR'), (5, 'Charlie', 28, 'Sales')]

2. Write a Python function to fetch and display employees whose names start with a specific letter.

In [64]:
def tbl_filt_nm(tbl,letter):
    cursor.execute(f'''
        select * from {tbl}
                WHERE NAME LIKE '{letter}%'
        ''')
    return cursor.fetchall()

In [65]:
func_tbl('Employees')

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales')]

In [66]:
tbl_filt_nm('Employees','b')

[(3, 'Bob', 25, 'Engineering'), (4, 'Bob', 25, 'Engineering')]

### Assignment 7: Handling Transactions

1. Write a Python function to insert multiple employees into the `employees` table in a single transaction. Ensure that if any insertion fails, none of the insertions are committed.

In [77]:
def multip_hand(data):
    try:
        cursor.executemany('INSERT INTO Employees VALUES (?,?,?,?)',data)
        connection.commit()
    except:
        connection.rollback()
        print("Can't Commit the changes as there are duplicates")
    
    return cursor.execute('Select * from Employees').fetchall()

In [78]:
func_tbl('Employees')

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales')]

In [79]:
employees = [
    (6, 'Frank', 40, 'Finance'),
    (7, 'Grace', 29, 'Engineering'),
    (8, 'Hannah', 35, 'Marketing'),
    (9, 'Ivan', 38, 'Sales'),
    (6, 'Jack', 45, 'HR')  # Duplicate ID to cause an error
]

In [80]:
multip_hand(employees)

Can't Commit the changes as there are duplicates

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales')]

In [81]:
employees1 = [
    (6, 'Frank', 40, 'Finance'),
    (7, 'Grace', 29, 'Engineering'),
    (8, 'Hannah', 35, 'Marketing'),
    (9, 'Ivan', 38, 'Sales')
]

In [82]:
multip_hand(employees1)

[(1, 'Kr', 60, 'HR'),
 (2, 'Mr', 50, 'HR'),
 (3, 'Bob', 25, 'Engineering'),
 (4, 'Bob', 25, 'Engineering'),
 (5, 'Charlie', 28, 'Sales'),
 (6, 'Frank', 40, 'Finance'),
 (7, 'Grace', 29, 'Engineering'),
 (8, 'Hannah', 35, 'Marketing'),
 (9, 'Ivan', 38, 'Sales')]

2. Write a Python function to update the age of multiple employees in a single transaction. Ensure that if any update fails, none of the updates are committed.

In [97]:
def updt_multiple(data):
    try:
        cursor.executemany("""
        update Employees
                   set age = ? 
                   where id = ?
                       """, data)
        connection.commit()
    except Exception as e:
        connection.rollback()
        print("There is issue at updating, the id doesn't Exists")
        print(e)
        
    finally:
        return cursor.execute("Select * from Employees").fetchall()

In [99]:
def updt_multiple(data):
    try:
        cursor.executemany('''
            UPDATE employees
            SET age = ?
            WHERE id = ?
        ''', data)
        connection.commit()
        print("All employee ages updated successfully.")
    except Exception as e:
        connection.rollback()
        print("Error occurred, transaction rolled back.")
        print(e)
    finally:
        return cursor.execute("Select * from Employees").fetchall()

In [94]:
updates = [
    (32, 1),
    (26, 2),
    (33, 3),
    (41, 4),  # Non-existing ID to cause an error
    (23, 5)
]

In [95]:
updt_multiple(updates)

[(1, 'Kr', 32, 'HR'),
 (2, 'Mr', 26, 'HR'),
 (3, 'Bob', 33, 'Engineering'),
 (4, 'Bob', 41, 'Engineering'),
 (5, 'Charlie', 23, 'Sales'),
 (6, 'Frank', 40, 'Finance'),
 (7, 'Grace', 29, 'Engineering'),
 (8, 'Hannah', 35, 'Marketing'),
 (9, 'Ivan', 38, 'Sales')]

In [101]:
updates1 = [
    (13, 1),
    (26, 22),
    (33,56)
]

updt_multiple(updates1)

All employee ages updated successfully.

[(1, 'Kr', 13, 'HR'),
 (2, 'Mr', 26, 'HR'),
 (3, 'Bob', 33, 'Engineering'),
 (4, 'Bob', 41, 'Engineering'),
 (5, 'Charlie', 23, 'Sales'),
 (6, 'Frank', 40, 'Finance'),
 (7, 'Grace', 29, 'Engineering'),
 (8, 'Hannah', 35, 'Marketing'),
 (9, 'Ivan', 38, 'Sales')]

In [119]:
def updt_multiple1(data):
    
    try:
        cursor.execute("BEGIN")
        for age, emp_id in data:
            # Check if employee exists
            cursor.execute("SELECT 1 FROM employees WHERE id = ?", (emp_id))

            if cursor.fetchone()[0] is None: #cursor.fetchone() is None:
                raise ValueError(f"Employee ID {emp_id} does not exist")

            # Perform update
            cursor.execute("UPDATE employees SET age = ? WHERE id = ?", (age, emp_id))

        connection.commit()
        print("âœ… All updates successful, transaction committed.")

    except Exception as e:
        connection.rollback()
        print("Error occurred, transaction rolled back.")
        print(e)
    finally:
        return cursor.execute("Select * from Employees").fetchall()

In [120]:
updates1 = [(30, 1), (45, 2), (50, 999)] 

updt_multiple(updates1)

All employee ages updated successfully.

[(1, 'Kr', 30, 'HR'),
 (2, 'Mr', 45, 'HR'),
 (3, 'Bob', 33, 'Engineering'),
 (4, 'Bob', 41, 'Engineering'),
 (5, 'Charlie', 23, 'Sales'),
 (6, 'Frank', 40, 'Finance'),
 (7, 'Grace', 29, 'Engineering'),
 (8, 'Hannah', 35, 'Marketing'),
 (9, 'Ivan', 38, 'Sales')]